#include <iostream> // ’σκηση 6.25
int main()
{
	int n50, n10, tot50, tot10, bnk_amnt, amnt, cust, tot_amnt, suc;

	tot50 = 500;
	tot10 = 1000;
	bnk_amnt = (10*tot10) + 50*(tot50);
	cust = tot_amnt = 0;
	do 
	{
		do 
		{
			std::cout << "\nEnter amount: ";
			std::cin >> amnt;
		} while(amnt < 10 || (amnt % 10 != 0));

		if(bnk_amnt >= amnt)
		{
			suc = 0;
			n50 = amnt/50;
			n10 = (amnt%50)/10;
	
			if(tot50 >= n50 && tot10 >= n10)
			{
				suc = 1; /* Η τιμή 1 σημαίνει ότι η ανάληψη θα ολοκληρωθεί με επιτυχία. */
			}
			else if(tot50 < n50) /* Αυτή η περίπτωση μπορεί να συμβεί αν ο αριθμός των απαιτούμενων 50-ευρων είναι μικρότερος από τον διαθέσιμο. Τότε, το ΑΤΜ δίνει όλα τα διαθέσιμα 50-ευρα και τα υπόλοιπα με χαρτονομίσματα των 10 ευρώ. Για παράδειγμα, αν υπάρχουν διαθέσιμα τρία 50-ευρα και είκοσι 10-ευρα και ο χρήστης ζητήσει ανάληψη 210 ευρώ, τότε το προηγούμενο if θα αποτύχει (γιατί tot50(3) >= n50(4)), ο κώδικας θα μπει σε αυτό το if, όπου θα δοθούν τα διαθέσιμα τρία 50-ευρα και έξι 10-ευρα. */
			{
				suc = 1;
				n50 = tot50; /* Δίνουμε όλα τα διαθέσιμα 50-εύρα. */
				n10 = (amnt - 50*tot50)/10;
			}
			else /* Αυτή η περίπτωση μπορεί να συμβεί αν δεν υπάρχουν τα ανάλογα χαρτονομίσματα. Για παράδειγμα, αν υπάρχουν διαθέσιμα δύο 50-ευρα και τρία 10-ευρα και ο χρήστης ζητήσει ανάληψη 90 ευρώ, τότε τα δύο προηγούμενα if θα αποτύχουν (το πρώτο γιατί tot10(3) >= n10(4) και το δεύτερο γιατί tot50(2) > n50(1)), ο κώδικας θα μπει σε αυτό το if, όπου θα εμφανιστεί το παρακάτω μήνυμα. */
				std::cout << "\nTransaction not completed. Try again with different amount.";				
			
			if(suc == 1)
			{
				tot50 -= n50;
				tot10 -= n10;	
				cust++;
				tot_amnt += amnt;
				bnk_amnt -= amnt;
			}
		}
		else
			std::cout << "\nTransaction not completed. Try again with less amount.";
	} while(tot50 > 0 && tot10 > 0);

 std::cout << "Cust = " << cust << " Total = %d\n" << tot_amnt << '\n';
	return 0;
}

